# -*- coding: utf-8 -*- 
# ヘルプなど

helps = {}

helps['?ヘルプ']='**コマンド一覧**\n本botで使用できるコマンドは次の通りです。\n※ヘルプコマンド以外はSimutrans起動時以外使用できません。\n\n`?ヘルプ` … 本botのヘルプを返します。補助的に`?help`も使用できます。\n`?待機,<駅名>,[エントリ数]` … 指定された停車場の待機客およびその行き先を返します。エントリ数のデフォルト値は5です。補助的に`?wait`も使用できます。\n`?プレイヤー` … ゲームに参加しているプレイヤー一覧と、その番号を返します。ここで返される番号は、プレイヤーを指定するコマンドで使用します。補助的に`?player`も使用できます。\n`?赤棒,[プレイヤー番号]` … 指定したプレイヤーに所属する停車場で、いわゆる赤棒が立っている駅とその待機客を返します。プレイヤー番号の指定がない場合は、すべての会社の赤棒を返します。補助的に`?akabo`も使用できます。\n`?時間` … 現在の年と月を返します。補助的に`?time`も使用できます。\n`?財政` … 各会社の資金を返します。補助的に`?財務`ならびに`?finance`も使用できます。\n`?路線,<プレイヤー番号>` … 指定したプレイヤーの路線番号と路線名を一覧で返します。補助的に`?route`も使用できます。\n`?停車駅,<路線番号>,[停車場数]` … 指定した路線のスケジュール上にある停車駅を順番に返します。3つ目のパラメーターを指定すると、路線上にある駅を利用者順でソートして返します。補助的に`?halt`も使用できます。'
helps['?help']='**コマンド一覧**\n本botで使用できるコマンドは次の通りです。\n※ヘルプコマンド以外はSimutrans起動時以外使用できません。\n\n`?ヘルプ` … 本botのヘルプを返します。補助的に`?help`も使用できます。\n`?待機,<駅名>,[エントリ数]` … 指定された停車場の待機客およびその行き先を返します。エントリ数のデフォルト値は5です。補助的に`?wait`も使用できます。\n`?プレイヤー` … ゲームに参加しているプレイヤー一覧と、その番号を返します。ここで返される番号は、プレイヤーを指定するコマンドで使用します。補助的に`?player`も使用できます。\n`?赤棒,[プレイヤー番号]` … 指定したプレイヤーに所属する停車場で、いわゆる赤棒が立っている駅とその待機客を返します。プレイヤー番号の指定がない場合は、すべての会社の赤棒を返します。補助的に`?akabo`も使用できます。\n`?時間` … 現在の年と月を返します。補助的に`?time`も使用できます。\n`?財政` … 各会社の資金を返します。補助的に`?財務`ならびに`?finance`も使用できます。\n`?路線,<プレイヤー番号>` … 指定したプレイヤーの路線番号と路線名を一覧で返します。補助的に`?route`も使用できます。\n`?停車駅,<路線番号>,[停車場数]` … 指定した路線のスケジュール上にある停車駅を順番に返します。3つ目のパラメーターを指定すると、路線上にある駅を利用者順でソートして返します。補助的に`?halt`も使用できます。'

# この先隠しコマンドあり！閲覧注意！






































































helps['?ahakuoku']='ahakuokuさんは、128jpの公開鯖の鯖主としてAHNSの創設に尽力し、AHNSに自由の雰囲気を築くために多大な功績を残した人です。どうかこのメッセージを消さないでください。'

helps['?かわぎえ']='ぎえーｗｗｗｗｗ'

helps['?お前を消す方法']='邪魔だったよね、ごめんね。もう少し役に立てるように頑張るよ。'

helps['?知っておこう']='（♪ﾃｯﾃｯﾃﾚﾚﾚﾃｯﾃｯﾃﾚﾚﾚﾃﾚﾚﾚﾚﾚﾚﾚﾚ）今日は、AHNSbotについて知っておこう。（ヘルプを表示します）\n**コマンド一覧**\n本botで使用できるコマンドは次の通りです。\n※ヘルプコマンド以外はSimutrans起動時以外使用できません。\n\n`?ヘルプ` … 本botのヘルプを返します。補助的に`?help`も使用できます。\n`?待機,<駅名>,[エントリ数]` … 指定された停車場の待機客およびその行き先を返します。エントリ数のデフォルト値は5です。補助的に`?wait`も使用できます。\n`?プレイヤー` … ゲームに参加しているプレイヤー一覧と、その番号を返します。ここで返される番号は、プレイヤーを指定するコマンドで使用します。補助的に`?player`も使用できます。\n`?赤棒,[プレイヤー番号]` … 指定したプレイヤーに所属する停車場で、いわゆる赤棒が立っている駅とその待機客を返します。プレイヤー番号の指定がない場合は、すべての会社の赤棒を返します。補助的に`?akabo`も使用できます。\n`?時間` … 現在の年と月を返します。補助的に`?time`も使用できます。\n`?財政` … 各会社の資金を返します。補助的に`?財務`ならびに`?finance`も使用できます。\n`?路線,<プレイヤー番号>` … 指定したプレイヤーの路線番号と路線名を一覧で返します。補助的に`?route`も使用できます。\n`?停車駅,<路線番号>,[停車場数]` … 指定した路線のスケジュール上にある停車駅を順番に返します。3つ目のパラメーターを指定すると、路線上にある駅を利用者順でソートして返します。補助的に`?halt`も使用できます。\nうーん、長いね。じゃ！（♪ﾃｰﾚﾃｰﾚﾃｯﾃｯﾃｰﾚﾃｰﾚﾃｯﾃｯﾃ）'