# -*- coding: utf-8 -*- 
# ヘルプなど

knAHNSs = {}

knAHNSs['']='記事名を指定してください。'
knAHNSs['横手車庫']='横手車庫とは、AHNS1の都市「横手」付近に創急電鉄の手によって建設されたクソデカい車庫の事である。\n\n創急電鉄は、開業当初より時間調整機能を本車庫に集中させており、後年本数が多くなった結果、これまでにないような規模の車庫が出来上がった。その規模は供用部分だけでも2層106線、未供用部分を合わせると3層194線という非常に大規模なものになった。一部では「103系の全製造車両を収容できる規模の車庫」などとも言われている。'
knAHNSs['おそロシア']='おそロシアとは、AHNS2のマップ南東の海上に存在した都市である。\n\n実際の設置形態としては、海上にポツンと役所のみが存在しており、その役所に300万人が住んでいるという計算であった。最寄り駅であるおそロシア駅は、1秒間に約200人の旅客が発生していた。'
knAHNSs['あほなす']='あほなすとは、AHNSの俗称である。ちなみに、正式な読み方は「あはんす」である。\n\nこの俗称の起源は、AHNS設立以前の2019年7月にNANSのDiscordサーバーで鯖主が「AHNS←ないです」と発言した際にかわごえが「あほなす」と返したことである。ここからAHNS設立までは正式名称が不明であったが、AHNS設立に伴い正式名称が「あはんす」であることが確定した。その後、2021年のエイプリルフールでサーバー名称が1日限りで「あほなす」に変更され公式化された。'
knAHNSs['AHNSbot']='AHNSbotとは、Discord上でAHNSゲーム内の様々な情報を提供するbotである。\n\nAHNSbotは、その動作にSimutrans world monitor( <https://github.com/teamhimeh/simutrans_world_monitor/blob/main/README.md> )をカスタマイズしたものを使用している。本記事では、主なカスタマイズ部分の仕様について記載する。本家Simutrans world monitorの仕様は上記のリンクを、コマンドの詳細については`?help` を参照されたい。\n\nAHNSbot独自の仕様として、コマンドの詳細を返す`?help` コマンドや英語でのコマンド入力の実装、文体の標準語化が行われている。さらに、らくらくNS( <https://github.com/ahakuoku/rakurakuNS/blob/main/readme.md> )と連携し、オートセーブの予告やサーバーダウンの通知なども行われている。また、おまけ機能として百科事典のようなテキストを返す`?これなにAHNS` コマンドや隠しコマンドが実装されている。'
knAHNSs['らくらくNS']='らくらくNSとは、鯖主が開発・公開しているNSの管理を自動化するソフトである。\n\nらくらくNSそのものはAHNSと直接関係はないが、元々本ソフトはAHNS向けに開発されているなどAHNSとのかかわりが深いため、これなにAHNSでの解説を行う。詳細な仕様については公式のreadme( <https://github.com/ahakuoku/rakurakuNS/blob/main/readme.md> )を参照されたい。\n\nらくらくNSは、サーバーダウン時の自動復旧、任意の間隔でのオートセーブ、さらに付随して必要な動作を自動で行うソフトであり、コードはbatで書かれている。python移植の構想もあるものの、2021年4月現在、進捗はみられていない。らくらくNSのような自動化ソフトは他にも存在するが、特徴的な機能としてはSimutrans world monitor経由でのDiscord連携機能が存在する。'
knAHNSs['先鋭語']='先鋭語とは、地理界隈発祥とされるインターネットスラングのことである。AHNSでよく使われる先鋭語として「爆劣」「全謬」「封鎖」などが存在している。現在のところ一般公開されている辞典は存在しない。'
knAHNSs['京津鯖辞典']='京津鯖語録とは、かつて京津鯖Wikiに存在していたページである。\n\n先鋭語を多く収録していた事に加え、一般公開されている先鋭語辞典が存在しないため、決して先鋭語辞典ではないながらも唯一の先鋭語辞典として重宝された。繰り返しになるが、あくまで先鋭語辞典ではないため、先鋭語でないものも含まれている。これなにAHNSに収録されている先鋭語のほとんどはこの京津鯖語録からの引用である。'
knAHNSs['劣っている']='劣っているとは、物事がよろしくない様子を意味する先鋭語である。'
knAHNSs['全謬']='全謬とは、全てが間違っていることを意味する先鋭語である。'
knAHNSs['爆劣']='爆劣とは、激しく劣っているさまを意味する先鋭語である。'
knAHNSs['封鎖']='封鎖とは、誰かをブロックすることを意味する先鋭語である。'