include("libs/common")

class get_help_cmd {
  // ヘルプを返す
  function exec(str) {
    local str = "**コマンド一覧**\n本botで使用できるコマンドは次の通りです。\n\n`?ヘルプ` … 本botのヘルプを返します。補助的に`?help`も使用できます。\n`?待機,<駅名>,[エントリ数]` … 指定された停車場の待機客およびその行き先を返します。エントリ数のデフォルト値は5です。補助的に`?wait`も使用できます。\n`?プレイヤー` … ゲームに参加しているプレイヤー一覧と、その番号を返します。ここで返される番号は、プレイヤーを指定するコマンドで使用します。補助的に`?player`も使用できます。\n`?赤棒,[プレイヤー番号]` … 指定したプレイヤーに所属する停車場で、いわゆる赤棒が立っている駅とその待機客を返します。プレイヤー番号の指定がない場合は、すべての会社の赤棒を返します。補助的に`?akabo`も使用できます。\n`?時間` … 現在の年と月を返します。補助的に`?time`も使用できます。\n`?財政` … 各会社の資金を返します。補助的に`?財務`ならびに`?finance`も使用できます。"
    local f = file(path_output,"w")
    f.writestr(rstrip(str))
    f.close() 
  }
}